[
    {
        "id": "large-language-models",
        "title": "Are Large Language Models Just Fancy Chatbots?",
        "date": "December 24, 2024",
        "summary": "Chatbots are just the beginning of what large language models can do.",
        "content": "Artificial intelligence (AI) is no longer just a concept in science fiction, it is real and already affecting people’s daily life. The manner that it exists is vastly different from the robot-filled stories we believed as children. Rather than an anthropomorphic entity, artificial intelligence exists largely behind the scenes, hidden in data centers and algorithms that operate away from public view.\n\nOne of the most accessible and recognizable applications of AI is large language models (LLMs), which power tools like ChatGPT and similar chatbots. For many, these chatbots represent their most direct interaction with AI. Since their launch, these tools have experienced explosive growth in adoption. By February 2024, [20% of Americans reported using ChatGPT](https://www.pewresearch.org/short-reads/2024/03/26/americans-use-of-chatgpt-is-ticking-up-but-few-trust-its-election-information/#:~:text=The%20share%20of%20employed%20Americans,or%20for%20entertainment%20(17%25).). Its versatility is evident in its wide-ranging applications—30% of adults have leveraged it for work-related tasks, such as drafting emails, generating reports, and brainstorming creative ideas.\n\nWhile these models have been embraced and widely adopted, their sophistication and significance as artificial intelligence are often underappreciated. A common critique dismisses large language models as nothing more than advanced text prediction algorithms. While technically accurate, this characterization fails to capture the remarkable complexity and innovation behind their design.\n\nConsider this thought experiment: present a well-read English speaker with a sentence containing an unfamiliar word. More often than not, they can infer its meaning with a high level of accuracy just from the context. This ability stems from the intricate patterns and relationships that exist within language, patterns learned and internalized through years of reading, communication, and cultural immersion.\n\nThe remarkable achievement of large language models is that, in their own way, they mirror this human capacity. The neural networks behind these models are able to process vast amounts of text and internalize their linguistic structure. Likewise, when these models encounter a sentence with a word they’ve never seen before, they can deduce its likely meaning from contextual cues. Like humans, these models don’t simply make mechanical predictions; instead, they synthesize information to achieve what can be described as a contextually relevant understanding.\n\nChatbots are currently the most familiar example of this technology in action, but they’re only scratching the surface of what’s possible."
    },
    {
        "id": "determinism-as-a-politic",
        "title": "Determinism as a Politic",
        "date": "November 12, 2024",
        "summary": "Reflections on my political worldview",
        "content": "Eight years ago, November 2016, I recall the chaos of Trump's first victory. I was 16 and it felt like the world was about to end. I remember getting into so many heated conversations with my classmates in my Texas high school. Most of them were Republican just to be edgy, being contrarian just because. Trump was obviously a con man who only cared about himself, and he was going to destroy everything. I saw that even at 16. Yeah, Hillary Clinton sucked, but she was infinitely better than Trump. And I argued this back and forth with my classmates.\n\nEight years later, I find myself in a similar position, though now it's more of a lukewarm conversation than heated, with my peers in my mid-20s. But something's different this time. I'm not the one emotionally affected by Trump's campaign – it's my peers who are, and they are shocked, maybe even concerned that I’m not. To be clear: my opinion of Trump hasn't changed. He's still a dangerous con man. And Kamala, like Hillary before her, might not be great, but she's better than Trump. Yet somehow, even as a Muslim named Muhammad, in a time when Trump built his platform on Islamophobia, I can't bring myself to feel that same concern that I once did.\n\nI'm writing this today to understand myself better..."
    },
    {
        "id": "nostalgia-for-boredom",
        "title": "Nostalgia for Boredom",
        "date": "April 16, 2024",
        "summary": "The lost art of doing nothing.",
        "content": "I’m a part of the older end of the Gen Z spectrum, I’m 24, which means I have some recollection of a period before the Internet took over as a central part of our existence. My memories of this pre-internet world are somewhat fleeting, but they still evoke a sense of nostalgia. I remember enough to enable me to draw comparisons between life back then and the digital age we live in today. I remember the excitement of waiting for my favorite TV show to air at a specific time each week and the small joys of playing outside, exploring the neighborhood with friends. These memories, although hazy, serve as a reminder of how much our world has evolved, and as I transition into adulthood, these memories have led me to reflect on the ways the Internet has reshaped our daily experiences. I’ve found myself asking, am I ok with this? Am I ok with how the world has changed?\n\nAs Gen Z, we are truly the first ‘internet generation’, some of my younger peers genuinely can’t remember what life was like before the internet. The internet has changed many things about how we live, like how we think and interact with others..."
    }
]
